### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [133]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
df = pd.read_csv(file_to_load)
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [134]:
df.count()
df.describe()

       Purchase ID         Age     Item ID       Price
count   780.000000  780.000000  780.000000  780.000000
mean    389.500000   22.714103   91.755128    3.050987
std     225.310896    6.659444   52.697702    1.169549
min       0.000000    7.000000    0.000000    1.000000
25%     194.750000   20.000000   47.750000    1.980000
50%     389.500000   22.000000   92.000000    3.150000
75%     584.250000   25.000000  138.000000    4.080000
max     779.000000   45.000000  183.000000    4.990000

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [135]:
df["Purchase ID"].unique()

array([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,
        13,  14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,
        26,  27,  28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,
        39,  40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,
        52,  53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,
        65,  66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,
        78,  79,  80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,
        91,  92,  93,  94,  95,  96,  97,  98,  99, 100, 101, 102, 103,
       104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116,
       117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129,
       130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142,
       143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155,
       156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168,
       169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181,
       182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194,
       195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207,
       208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220,
       221, 222, 223, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233,
       234, 235, 236, 237, 238, 239, 240, 241, 242, 243, 244, 245, 246,
       247, 248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259,
       260, 261, 262, 263, 264, 265, 266, 267, 268, 269, 270, 271, 272,
       273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 284, 285,
       286, 287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298,
       299, 300, 301, 302, 303, 304, 305, 306, 307, 308, 309, 310, 311,
       312, 313, 314, 315, 316, 317, 318, 319, 320, 321, 322, 323, 324,
       325, 326, 327, 328, 329, 330, 331, 332, 333, 334, 335, 336, 337,
       338, 339, 340, 341, 342, 343, 344, 345, 346, 347, 348, 349, 350,
       351, 352, 353, 354, 355, 356, 357, 358, 359, 360, 361, 362, 363,
       364, 365, 366, 367, 368, 369, 370, 371, 372, 373, 374, 375, 376,
       377, 378, 379, 380, 381, 382, 383, 384, 385, 386, 387, 388, 389,
       390, 391, 392, 393, 394, 395, 396, 397, 398, 399, 400, 401, 402,
       403, 404, 405, 406, 407, 408, 409, 410, 411, 412, 413, 414, 415,
       416, 417, 418, 419, 420, 421, 422, 423, 424, 425, 426, 427, 428,
       429, 430, 431, 432, 433, 434, 435, 436, 437, 438, 439, 440, 441,
       442, 443, 444, 445, 446, 447, 448, 449, 450, 451, 452, 453, 454,
       455, 456, 457, 458, 459, 460, 461, 462, 463, 464, 465, 466, 467,
       468, 469, 470, 471, 472, 473, 474, 475, 476, 477, 478, 479, 480,
       481, 482, 483, 484, 485, 486, 487, 488, 489, 490, 491, 492, 493,
       494, 495, 496, 497, 498, 499, 500, 501, 502, 503, 504, 505, 506,
       507, 508, 509, 510, 511, 512, 513, 514, 515, 516, 517, 518, 519,
       520, 521, 522, 523, 524, 525, 526, 527, 528, 529, 530, 531, 532,
       533, 534, 535, 536, 537, 538, 539, 540, 541, 542, 543, 544, 545,
       546, 547, 548, 549, 550, 551, 552, 553, 554, 555, 556, 557, 558,
       559, 560, 561, 562, 563, 564, 565, 566, 567, 568, 569, 570, 571,
       572, 573, 574, 575, 576, 577, 578, 579, 580, 581, 582, 583, 584,
       585, 586, 587, 588, 589, 590, 591, 592, 593, 594, 595, 596, 597,
       598, 599, 600, 601, 602, 603, 604, 605, 606, 607, 608, 609, 610,
       611, 612, 613, 614, 615, 616, 617, 618, 619, 620, 621, 622, 623,
       624, 625, 626, 627, 628, 629, 630, 631, 632, 633, 634, 635, 636,
       637, 638, 639, 640, 641, 642, 643, 644, 645, 646, 647, 648, 649,
       650, 651, 652, 653, 654, 655, 656, 657, 658, 659, 660, 661, 662,
       663, 664, 665, 666, 667, 668, 669, 670, 671, 672, 673, 674, 675,
       676, 677, 678, 679, 680, 681, 682, 683, 684, 685, 686, 687, 688,
       689, 690, 691, 692, 693, 694, 695, 696, 697, 698, 699, 700, 701,
       702, 703, 704, 705, 706, 707, 708, 709, 710, 711, 712, 713, 714,
       715, 716, 717, 718, 719, 720, 721, 722, 723, 724, 725, 726, 727,
       728, 729, 730, 731, 732, 733, 734, 735, 736, 737, 738, 739, 740,
       741, 742, 743, 744, 745, 746, 747, 748, 749, 750, 751, 752, 753,
       754, 755, 756, 757, 758, 759, 760, 761, 762, 763, 764, 765, 766,
       767, 768, 769, 770, 771, 772, 773, 774, 775, 776, 777, 778, 779])

In [136]:
df["Age"].unique()

array([20, 40, 24, 23, 22, 36, 35, 21, 30, 38, 29, 11,  7, 19, 37, 10,  8,
       18, 27, 33, 32, 25, 12, 34, 17, 15, 13, 26, 16, 28, 31, 39, 44, 41,
        9, 14, 42, 43, 45])

In [137]:
df["Item ID"].unique()

array([108, 143,  92, 100, 131,  81, 169, 162,  21, 136,  95, 116,   4,
       165,  98,  40, 161,  82,  89,  57, 168,  24, 151, 132, 178,  71,
        96, 119,  37, 140, 179, 133,  44, 160,  53,  76,  73, 172,   7,
        72,   9, 181, 102, 170, 138, 110,  22,  15,  60, 176,  25,  84,
        80, 152, 105, 125,  56,  34,   6,  27,  29,  68, 124,  88,  20,
        50, 174,  12,  33, 129,  17,  59,  39, 164, 134, 109,  10,  54,
        99,  85, 139,  41, 150,  13, 117,  78,  87,   1,  62,  75,  58,
        74, 120, 145,   0,   2, 146, 158,   8, 175,  46, 148, 111,   3,
        65, 183,  30, 157, 123,   5, 144, 103, 135,  51, 154,  32,  77,
        11,  63,  69, 113, 153, 114, 149, 159, 137, 142,  66,  97, 163,
       107,  16,  42,  19,  83,  28,  94, 182,  70,  18, 166, 173, 167,
       155, 128, 156, 147,  35, 171,  52, 106,  38,  91, 118,  67,  45,
        49, 121,  79,  14,  43,  31,  64,  86,  93,  26, 122,  61,  48,
       112, 126, 115,  55, 127,  47, 130,  90, 177, 104])

In [138]:
df["Price"].unique()

array([3.53, 1.56, 4.88, 3.27, 1.44, 3.61, 2.18, 2.67, 1.1 , 3.58, 4.74,
       4.18, 1.7 , 4.86, 2.89, 2.52, 1.76, 4.9 , 4.64, 4.6 , 1.48, 3.81,
       3.4 , 3.19, 4.23, 1.61, 3.09, 4.32, 3.16, 2.94, 4.48, 4.09, 2.38,
       4.4 , 2.05, 3.15, 3.14, 1.33, 3.77, 2.73, 1.66, 3.44, 3.97, 2.96,
       3.54, 2.84, 4.35, 3.79, 3.39, 1.74, 3.03, 1.  , 2.92, 2.22, 3.7 ,
       3.3 , 1.98, 1.29, 3.75, 3.47, 1.02, 1.16, 1.54, 3.94, 1.63, 4.5 ,
       4.19, 4.76, 1.79, 2.5 , 1.71, 1.75, 4.94, 4.75, 2.85, 1.41, 4.43,
       3.26, 1.87, 2.42, 4.14, 3.08, 4.58, 1.28, 2.48, 3.1 , 2.45, 3.93,
       4.03, 4.89, 2.49, 4.24, 1.09, 2.21, 4.8 , 2.28, 4.08, 1.94, 1.4 ,
       4.66, 1.14, 4.  , 3.65, 4.99, 4.07, 3.74, 3.82, 2.62, 3.45, 3.55,
       3.33, 1.99, 1.06, 3.49, 1.03, 4.65, 3.07, 4.93, 1.01, 4.91, 1.77,
       4.84, 3.41, 2.37, 4.17, 2.17, 3.46, 3.85, 1.6 , 4.05, 2.61, 1.55,
       4.82, 2.27, 1.97, 1.12, 3.87, 2.6 , 2.  , 2.04, 3.92, 2.07, 2.08,
       1.93, 3.36])

In [139]:
df["Price"].mean()

3.050987179487176

In [140]:
df["Age"].mean()

22.714102564102564

In [141]:
df["Price"].value_counts()

4.40    21
4.23    20
4.35    14
2.18    14
1.02    14
        ..
2.17     1
4.17     1
1.99     1
4.50     1
3.30     1
Name: Price, Length: 145, dtype: int64

In [142]:
df["SN"].value_counts()

Lisosia93        5
Iral74           4
Idastidru52      4
Chanastnya43     3
Pheodaisun84     3
                ..
Qilatista90      1
Lisirra25        1
Tyidainu31       1
Assehoan67       1
Mindirranya33    1
Name: SN, Length: 576, dtype: int64

In [143]:
df["Age"].value_counts()

20    99
22    70
24    67
23    67
21    62
25    59
15    35
30    35
16    30
18    26
19    23
17    22
35    14
33    14
26    14
29    13
27    10
10     9
7      9
34     9
38     9
32     8
8      8
11     7
31     7
37     7
39     6
40     6
9      6
12     6
36     5
28     5
13     4
44     2
41     2
14     2
43     1
42     1
45     1
Name: Age, dtype: int64

In [144]:
items_df = len(df["Item Name"].value_counts())
items_df

179

In [145]:
average_df = round(df["Price"].mean(), 2)
average_df

3.05

In [146]:
total_purchases_df = len(df["Item Name"])
total_purchases_df

780

In [147]:
total_revenue_df = round(df["Price"].sum(),2)
total_revenue_df

2379.77

In [148]:
summary_df = pd.DataFrame({"Number of Unique Items":[items_df],
                                             "Average Purchase Price":[average_df],
                                            "Total Number of Purchases":[total_purchases_df],
                                             "Total Revenue":[total_revenue_df]})
summary_df

,Number of Unique Items,Average Purchase Price,Total Number of Purchases,Total Revenue
0,179,3.05,780,2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [149]:
df["Gender"].value_counts()

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [150]:
gender_percentage_df = round(df["Gender"].value_counts()/780,2)
gender_percentage_df

Male                     0.84
Female                   0.14
Other / Non-Disclosed    0.02
Name: Gender, dtype: float64

In [151]:
female_count_df = df.loc[df["Gender"]=="Female",:]
female_count_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
15,15,Lisassa64,21,Female,98,"Deadline, Voice Of Subtlety",2.89
18,18,Reunasu60,22,Female,82,Nirvana,4.90
38,38,Reulae52,10,Female,116,Renewed Skeletal Katana,4.18
41,41,Assosia88,20,Female,7,"Thorn, Satchel of Dark Souls",1.33
55,55,Phaelap26,25,Female,84,Arcane Gem,3.79

In [152]:
male_count_df = df.loc[df["Gender"]=="Male",:]
male_count_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [153]:
average_df = round(df["Price"].mean(), 2)
average_df

3.05

In [154]:
female_purchases_df = len(female_count_df["Item ID"])
female_purchases_df

113

In [155]:
female_average_df = round(female_count_df["Price"].mean(),2)
female_average_df

3.2

In [156]:
female_total_df = round(female_count_df["Price"].sum(), 2)
female_total_df

361.94

In [157]:
male_count_df = df.loc[df["Gender"]=="Male",:]
male_count_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [158]:
male_purchases_df = len(male_count_df["Item ID"])
male_purchases_df

652

In [159]:
male_average_df = round(male_count_df["Price"].mean(),2)
male_average_df

3.02

In [160]:
male_total_df = round(male_count_df["Price"].sum(), 2)
male_total_df

1967.64

In [161]:
other_count_df = df.loc[df["Gender"]=="Other / Non-Disclosed",:]
other_count_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
9,9,Chanosian48,35,Other / Non-Disclosed,136,Ghastly Adamantite Protector,3.58
22,22,Siarithria38,38,Other / Non-Disclosed,24,Warped Fetish,3.81
82,82,Haerithp41,16,Other / Non-Disclosed,160,Azurewrath,4.40
111,111,Sundim98,21,Other / Non-Disclosed,41,Orbit,4.75
228,228,Jiskirran77,20,Other / Non-Disclosed,80,Dreamsong,3.39
237,237,Idairin51,20,Other / Non-Disclosed,16,Restored Bauble,3.55
242,242,Eodaisu60,16,Other / Non-Disclosed,39,"Betrayal, Whisper of Grieving Widows",3.94
291,291,Idairin51,20,Other / Non-Disclosed,35,Heartless Bone Dualblade,3.45
350,350,Rairith81,15,Other / Non-Disclosed,34,Retribution Axe,2.22
401,401,Lirtim36,15,Other / Non-Disclosed,46,Hopeless Ebon Dualblade,1.33
484,484,Chanosian48,35,Other / Non-Disclosed,39,"Betrayal, Whisper of Grieving Widows",3.94
549,549,Maluncil97,25,Other / Non-Disclosed,146,Warped Iron Scimitar,3.10
629,629,Maluncil97,25,Other / Non-Disclosed,107,"Splitter, Foe Of Subtlety",2.18
637,637,Airi27,24,Other / Non-Disclosed,163,Thunderfury Scimitar,3.45
747,747,Siarithria38,38,Other / Non-Disclosed,146,Warped Iron Scimitar,3.10

In [162]:
other_purchases_df = len(other_count_df["Item ID"])
other_purchases_df

15

In [163]:
other_average_df = round(other_count_df["Price"].mean(),2)
other_average_df

3.35

In [164]:
other_total_df = round(other_count_df["Price"].sum(), 2)
other_total_df

50.19

In [165]:
female_purchase_analysis_df = pd.DataFrame({"Purchase Count":[female_purchases_df],
                                            "Average Purchase Price":[female_average_df],
                                            "Total Purchase Value":[female_total_df],})
female_purchase_analysis_df

   Purchase Count  Average Purchase Price  Total Purchase Value
0             113                     3.2                361.94

In [166]:
male_purchase_analysis_df = pd.DataFrame({"Purchase Count":[male_purchases_df],
                                         "Average Purchase Price":[male_average_df],
                                         "Total Purchase Value":[male_total_df]})                                       
male_purchase_analysis_df

   Purchase Count  Average Purchase Price  Total Purchase Value
0             652                    3.02               1967.64

In [167]:
other_purchase_analysis_df = pd.DataFrame({"Purchase Count":[other_purchases_df],
                                         "Average Purchase Price":[other_average_df],
                                         "Total Purchase Value":[other_total_df]})
other_purchase_analysis_df

   Purchase Count  Average Purchase Price  Total Purchase Value
0              15                    3.35                 50.19

In [168]:
female_purchase_analysis_df.append(male_purchase_analysis_df).append(other_purchase_analysis_df)

   Purchase Count  Average Purchase Price  Total Purchase Value
0             113                    3.20                361.94
0             652                    3.02               1967.64
0              15                    3.35                 50.19

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [169]:
bins = [0,10,15,20,25,30,35,40, 45]
age_ranges = ["<10", "10-14","15-19", "20-24", "25-29", "30-34", "35-39", ">=40"]

In [170]:
pd.cut(df["Age"], bins, labels=age_ranges)

0      15-19
1      35-39
2      20-24
3      20-24
4      20-24
       ...
775    20-24
776    20-24
777    15-19
778      <10
779    20-24
Name: Age, Length: 780, dtype: category
Categories (8, object): ['<10' < '10-14' < '15-19' < '20-24' < '25-29' < '30-34' < '35-39' < '>=40']

In [171]:
df["Age Range"] = pd.cut(df["Age"], bins, labels= age_ranges)
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Range
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,15-19
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,35-39
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [172]:
age_group =df.groupby("Age Range")
print(age_group["SN"].count())

Age Range
<10       32
10-14     54
15-19    200
20-24    325
25-29     77
30-34     52
35-39     33
>=40       7
Name: SN, dtype: int64

In [176]:
Age_group_percentage_df = round(df["Age Range"].value_counts()/780,2)
Age_group_percentage_df

20-24    0.42
15-19    0.26
25-29    0.10
10-14    0.07
30-34    0.07
35-39    0.04
<10      0.04
>=40     0.01
Name: Age Range, dtype: float64

In [177]:
under_10_count_df = df.loc[df["Age Range"] == "<10",:]
under_10_count_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Range
27,27,Eusri44,7,Male,96,Blood-Forged Skeletal Spine,3.09,<10
32,32,Aeralria27,10,Male,133,Faith's Scimitar,4.09,<10
33,33,Haillyrgue51,7,Male,44,Bonecarvin Battle Axe,2.38,<10
37,37,Seuthep89,8,Male,73,Ritual Mace,2.05,<10
38,38,Reulae52,10,Female,116,Renewed Skeletal Katana,4.18,<10

In [178]:
under10_average_df = round(under_10_count_df["Price"].mean(),2)
under10_average_df

3.4

In [179]:
under10_total_df = round(under_10_count_df["Price"].sum(), 2)
under10_total_df

108.96

In [180]:
under_10_purchases_df = len(under_10_count_df["Item ID"])
under_10_purchases_df

32

In [181]:
count_10to14_df = df.loc[df["Age Range"] == "10-14",:]
count_10to14_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Range
26,26,Lirtossa84,11,Male,71,Demise,1.61,10-14
56,56,Raesty92,12,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,10-14
68,68,Indonmol95,15,Male,27,"Riddle, Tribute of Ended Dreams",3.30,10-14
76,76,Mindadaran26,13,Female,88,"Emberling, Defender of Delusions",3.75,10-14
113,113,Phyali88,15,Female,140,Striker,2.94,10-14

In [182]:
purchases_10to14_df = len(count_10to14_df["Item ID"])
purchases_10to14_df

54

In [183]:
purchases_10to14_df = len(count_10to14_df["Item ID"])
purchases_10to14_df

54

In [184]:
average10to14_df = round(count_10to14_df["Price"].mean(),2)
average10to14_df

2.9

In [185]:
total_10to14_df = round(count_10to14_df["Price"].sum(), 2)
total_10to14_df

156.6

In [186]:

count15to19_df = df.loc[df["Age Range"] == "15-19",:]
count15to19_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Range
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,15-19
7,7,Iskjaskst81,20,Male,162,Abyssal Shard,2.67,15-19
16,16,Lisirra25,20,Male,40,Second Chance,2.52,15-19
20,20,Iathenudil29,20,Male,57,"Despair, Favor of Due Diligence",4.60,15-19
21,21,Phiarithdeu40,20,Male,168,"Sun Strike, Jaws of Twisted Visions",1.48,15-19

In [187]:
purchase15to19_df = len(count15to19_df["Item ID"])
purchase15to19_df

200

In [188]:
average15to19_df = round(count15to19_df["Price"].mean(),2)
average15to19_df

3.11

In [189]:
total_15to19_df = round(count15to19_df["Price"].sum(),2)
total_15to19_df

621.56

In [190]:
count20to24_df = df.loc[df["Age Range"] == "20-24",:]
count20to24_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Range
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
5,5,Yalae81,22,Male,81,Dreamkiss,3.61,20-24
8,8,Undjask33,22,Male,21,Souleater,1.10,20-24

In [193]:
purchases20to24_df = len(count20to24_df["Item ID"])
purchases20to24_df

325

In [194]:
average20to24_df = round(count20to24_df["Price"]).mean()
average20to24_df

3.0092307692307694

In [195]:
total20to24_df = round(count20to24_df["Price"]).sum()
total20to24_df

978.0

In [196]:
count25to29_df = df.loc[df["Age Range"] == "25-29",:]
count15to19_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Range
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,15-19
7,7,Iskjaskst81,20,Male,162,Abyssal Shard,2.67,15-19
16,16,Lisirra25,20,Male,40,Second Chance,2.52,15-19
20,20,Iathenudil29,20,Male,57,"Despair, Favor of Due Diligence",4.60,15-19
21,21,Phiarithdeu40,20,Male,168,"Sun Strike, Jaws of Twisted Visions",1.48,15-19

In [197]:
tp_25to29_df = len(count25to29_df["Item ID"])
tp_25to29_df

77

In [198]:
average25to29_df = round(count25to29_df["Price"]).mean()
average25to29_df

2.792207792207792

In [199]:
tvp_25to29_df = round(count25to29_df["Price"]).sum()
tvp_25to29_df

215.0

In [200]:
count30to34_df = df.loc[df["Age Range"] == "30-34",:]
count30to34_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Range
9,9,Chanosian48,35,Other / Non-Disclosed,136,Ghastly Adamantite Protector,3.58,30-34
14,14,Saesrideu94,35,Male,165,Bone Crushing Silver Skewer,4.86,30-34
49,49,Iaralrgue74,33,Male,110,Suspension,1.44,30-34
53,53,Ilosianya35,32,Male,176,Relentless Iron Skewer,2.84,30-34
60,60,Yadanu52,34,Male,44,Bonecarvin Battle Axe,2.38,30-34

In [201]:
tp30to34_df = len(count30to34_df["Item ID"])
tp30to34_df

52

In [202]:
average30to34_df = round(count30to34_df["Price"]).mean()
average30to34_df

2.980769230769231

In [203]:
total30to34_df = round(count30to34_df["Price"]).sum()
total30to34_df

155.0

In [204]:
count35to39_df = df.loc[df["Age Range"] == "35-39",:]
count35to39_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Range
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,35-39
6,6,Itheria73,36,Male,169,"Interrogator, Blood Blade of the Queen",2.18,35-39
22,22,Siarithria38,38,Other / Non-Disclosed,24,Warped Fetish,3.81,35-39
23,23,Eyrian71,40,Male,151,Severance,3.40,35-39
31,31,Farusrian86,37,Male,179,"Wolf, Promise of the Moonwalker",4.48,35-39

In [205]:

count35to39_df = len(count35to39_df["Item ID"])
count35to39_df

33

In [207]:
average35to39_df = round(count35to39_df["Price"]).mean()
average35to39_df

TypeError: 'int' object is not subscriptable

In [208]:
total35to39_df = round(count35to39_df["Price"]).sum()
total35to39_df

TypeError: 'int' object is not subscriptable

In [209]:
countover40_df = df.loc[df["Age Range"] == ">40",:]
countover40_df.head()

Empty DataFrame
Columns: [Purchase ID, SN, Age, Gender, Item ID, Item Name, Price, Age Range]
Index: []

In [210]:
count40_df = len(countover40_df["Item ID"])
count40_df

0

In [211]:
average40_df = round(countover40_df["Price"]).mean()
average40_df

nan

In [212]:
total40_df = round(countover40_df["Price"]).sum()
total40_df

0.0

In [213]:
under10_df = pd.DataFrame({"Purchase Count":[under_10_purchases_df],
               "Average Purchase Price":[under10_average_df],
               "Total Purchase Value":[under10_total_df]})
under10_df

   Purchase Count  Average Purchase Price  Total Purchase Value
0              32                     3.4                108.96

In [214]:
summary10to14_df = pd.DataFrame({"Purchase Count":[purchases_10to14_df],
               "Average Purchase Price":[average10to14_df],
               "Total Purchase Value":[total_10to14_df]})
summary10to14_df

   Purchase Count  Average Purchase Price  Total Purchase Value
0              54                     2.9                 156.6

In [215]:
summary15to19_df = pd.DataFrame({"Purchase Count":[purchase15to19_df],
               "Average Purchase Price":[average15to19_df],
               "Total Purchase Value":[total_15to19_df]})
summary15to19_df

   Purchase Count  Average Purchase Price  Total Purchase Value
0             200                    3.11                621.56

In [216]:
summary20to24_df = pd.DataFrame({"Purchase Count":[purchases20to24_df],
               "Average Purchase Price":[average20to24_df],
               "Total Purchase Value":[total20to24_df]})
summary20to24_df

   Purchase Count  Average Purchase Price  Total Purchase Value
0             325                3.009231                 978.0

In [217]:
summary25to29_df = pd.DataFrame({"Purchase Count":[tp_25to29_df],
               "Average Purchase Price":[average20to24_df],
               "Total Purchase Value":[tvp_25to29_df]})
summary25to29_df

   Purchase Count  Average Purchase Price  Total Purchase Value
0              77                3.009231                 215.0

In [218]:
summary30to34_df = pd.DataFrame({"Purchase Count":[tp30to34_df],
               "Average Purchase Price":[average30to34_df],
               "Total Purchase Value":[total30to34_df]})
summary30to34_df

   Purchase Count  Average Purchase Price  Total Purchase Value
0              52                2.980769                 155.0

In [219]:
summary35to39_df = pd.DataFrame({"Purchase Count":[count35to39_df],
               "Average Purchase Price":[average35to39_df],
               "Total Purchase Value":[total35to39_df]})
summary35to39_df

NameError: name 'average35to39_df' is not defined

In [220]:
summary40_df = pd.DataFrame({"Purchase Count":[count40_df],
               "Average Purchase Price":[average40_df],
               "Total Purchase Value":[total40_df]})
summary40_df

   Purchase Count  Average Purchase Price  Total Purchase Value
0               0                     NaN                   0.0

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [221]:
grouped_items_df = df.groupby(['Item Name', 'Price'])

print(grouped_items_df)

grouped_items_df.count()

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7fbe7aee8970>

,,Purchase ID,SN,Age,Gender,Item ID,Age Range
Item Name,Price,,,,,,
Abyssal Shard,2.67,5,5,5,5,5,5
"Aetherius, Boon of the Blessed",3.39,5,5,5,5,5,5
Agatha,3.08,6,6,6,6,6,6
Alpha,2.07,3,3,3,3,3,3
"Alpha, Oath of Zeal",4.05,3,3,3,3,3,3
...,...,...,...,...,...,...,...
Wolf,3.54,8,8,8,8,8,8
"Wolf, Promise of the Moonwalker",4.48,6,6,6,6,6,6
Worldbreaker,2.60,4,4,4,4,4,4
Yearning Crusher,4.18,3,3,3,3,3,3
Yearning Mageblade,3.82,5,5,5,5,5,5

In [222]:
count = df['Item Name'].value_counts()
count.head()

Final Critic                                    13
Oathbreaker, Last Hope of the Breaking Storm    12
Nirvana                                          9
Fiery Glass Crusader                             9
Extraction, Quickblade Of Trembling Hands        9
Name: Item Name, dtype: int64

In [223]:
count = df['Item ID'].value_counts()
count.head()

92     13
178    12
108     9
132     9
82      9
Name: Item ID, dtype: int64

In [224]:
df.groupby(['SN', 'Item Name'])['SN'].count()

SN            Item Name
Adairialis76  Twilight's Carver                            1
Adastirin33   Woeful Adamantite Claymore                   1
Aeda94        Blazeguard, Reach of Eternity                1
Aela59        Stormbringer, Dark Blade of Ending Misery    1
Aelaria33     Scalpel                                      1
                                                          ..
Zhisrisu83    Hero Cane                                    1
              Wolf                                         1
Zontibe81     Arcane Gem                                   1
              Devine                                       1
              Verdict                                      1
Name: SN, Length: 780, dtype: int64

In [225]:
summarypopular_df = pd.DataFrame({"Item name":[df],
               "Item ID":[df],
               "SN":[df]})
summarypopular_df

,Item name,Item ID,SN
0,Purchase ID SN Age Gender ...,Purchase ID SN Age Gender ...,Purchase ID SN Age Gender ...

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame